NguyenDuyThan/Libraries_common/HW_lib/STM32F1_tim.c
/*------------------------------------------------------------------------------------------
 * INTRODUCE
 * Brief: This is source file contain function to setup Timer peripherals.
 * Author: Duy Vinh To - Team DinhViSo
 * Detail:
 -------------------------------------------------------------------------------------------*/
/*------------------------------------------------------------------------------------------
 * INCLUDES
 -------------------------------------------------------------------------------------------*/
#include "stddef.h"
#include "STM32F1_tim.h"
#include "misc.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_tim.h"
#include "STM32F1_nvic.h"
#include "additionalIRQhdler.h"
/*------------------------------------------------------------------------------------------
 * DEFINES
 -------------------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------------------
 * VARIABLES
 -------------------------------------------------------------------------------------------*/
static RCC_ClocksTypeDef RCC_Clocks;
static TIM_tick_CB TIM1_tick = (void*)0//
					, TIM2_tick = (void*)0//
					, TIM3_tick = (void*)0//
					, TIM4_tick = (void*)0//
					, TIM5_tick = (void*)0//
					;
static uint8_t TIM3CH2_IC_rdStep = 0//
		, TIM3CH1_IC_rdStep = 0//
		//, TIM2CH4_IC_rdStep = 0//
		;
static uint16_t TIM2CH4_IC_rdVal1 = 0, TIM2CH4_IC_rdVal2 = 0//
		, TIM3CH2_IC_rdVal1 = 0, TIM3CH2_IC_rdVal2 = 0, TIM3_CH2_IC_startTime = 0, TIM3_CH2_IC_endTime = 0//
		, TIM3CH1_IC_rdVal1 = 0, TIM3CH1_IC_rdVal2 = 0//
		;
static uint32_t TIM2CH4_IC_freq = 0, TIM3CH1_IC_freq = 0, TIM3CH2_IC_freq = 0, TIM3CH2_IC_OFct = 0;
static uint32_t TIM3CH2_ = 0;
/*----------------------------------------------------------------------------------------
 * Brief:	Setup Timer
 * Param:	tim		|	IN	|	timer selection. Only support timer 2 now.
 * 			freq	|	IN	|	frequency selection.
 * 			tickCB	|	IN	|	tick handler callback.
 -----------------------------------------------------------------------------------------*/
void TIM_setup(uint8_t tim, TIM_FREQ_t freq, TIM_tick_CB tickCB)
{
	TIM_TypeDef *TIMx;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	uint8_t TIMx_IRQn;

	RCC_GetClocksFreq(&RCC_Clocks);
	switch (tim)
	{
		case 1:
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
			TIMx = TIM1;
			TIM1_tick = tickCB;
			TIMx_IRQn = TIM1_UP_IRQn;
			break;
		case 2:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
			TIMx = TIM2;
			TIM2_tick = tickCB;
			TIMx_IRQn = TIM2_IRQn;
			break;
		case 3:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
			TIMx = TIM3;
			TIM3_tick = tickCB;
			TIMx_IRQn = TIM3_IRQn;
			break;
		case 4:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
			TIMx = TIM4;
			TIM4_tick = tickCB;
			TIMx_IRQn = TIM4_IRQn;
			break;
#ifndef STM32F10X_HD
#else
#ifndef STM32F10X_HD_VL
#else
#ifndef STM32F10X_XL
#else
#ifndef STM32F10X_CL
#else
		case 5:
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
			TIMx = TIM5;
			TIM5_tick = tickCB;
			TIMx_IRQn = TIM5_IRQn;
			break;
#endif // STM32F10X_CL
#endif // STM32F10X_XL
#endif // STM32F10X_HD_VL
#endif // STM32F10X_HD
		default:
			return;
	}
	switch (freq)
	{
		case TIMFREQ_1Hz:
			TIM_TimeBaseStructure.TIM_Period = 1000 + 1;
			TIM_TimeBaseStructure.TIM_Prescaler = (RCC_Clocks.SYSCLK_Frequency / 1000000) * 1000;
			TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
			break;
		case TIMFREQ_100Hz:
			TIM_TimeBaseStructure.TIM_Period = 1000 + 1;
			TIM_TimeBaseStructure.TIM_Prescaler = (RCC_Clocks.SYSCLK_Frequency / 1000000) * 10;
			TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
			break;
		case TIMFREQ_1KHz:
			TIM_TimeBaseStructure.TIM_Period = 1000 + 1;
			TIM_TimeBaseStructure.TIM_Prescaler = (RCC_Clocks.SYSCLK_Frequency / 1000000) * 1;
			TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
			break;
		case TIMFREQ_5KHz:
			TIM_TimeBaseStructure.TIM_Period = 500 + 1;
			TIM_TimeBaseStructure.TIM_Prescaler = (RCC_Clocks.SYSCLK_Frequency / 1000000) * 1;
			TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
			break;
		case TIMFREQ_10KHz:
			TIM_TimeBaseStructure.TIM_Period = 100 + 1;
			TIM_TimeBaseStructure.TIM_Prescaler = (RCC_Clocks.SYSCLK_Frequency / 1000000) * 1;
			TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
			break;
		case TIMFREQ_50KHz:
			TIM_TimeBaseStructure.TIM_Period = 20 + 1;
			TIM_TimeBaseStructure.TIM_Prescaler = (RCC_Clocks.SYSCLK_Frequency / 1000000) * 1;
			TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
			break;
		case TIMFREQ_100KHz:
			TIM_TimeBaseStructure.TIM_Period = 10 + 1;
			TIM_TimeBaseStructure.TIM_Prescaler = (RCC_Clocks.SYSCLK_Frequency / 1000000) * 1;
			TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
			break;
		case TIMFREQ_1MHz:
			TIM_TimeBaseStructure.TIM_Period = 1 + 1;
			TIM_TimeBaseStructure.TIM_Prescaler = (RCC_Clocks.SYSCLK_Frequency / 1000000) * 1;
			TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
			break;
		default:
			return;
	}
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIMx, &TIM_TimeBaseStructure);
	TIM_Cmd(TIMx, ENABLE);
	TIM_ITConfig(TIMx, TIM_IT_Update, (tickCB != NULL) ? ENABLE : DISABLE);
	if (tickCB != NULL)
	{
		NVIC_add(TIMx_IRQn);
	}
	else
	{
		NVIC_rmv(TIMx_IRQn);
	}
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup PWM on Timer 1 channel 1: pin mapping to PA8
 -----------------------------------------------------------------------------------------*/
void TIM1CH1_PWM_setup(TIM_FREQ_t freq)
{
	TIM_OCInitTypeDef TIM_OCInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	TIM_setup(1, freq, (void*)0);
	/* PWM1 Mode configuration: Channel1 */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //TIM_OCPolarity_Low;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High; //TIM_OCNPolarity_Low;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;

	TIM_OC1Init(TIM1, &TIM_OCInitStructure);
	TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	TIM_CtrlPWMOutputs(TIM1, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------------------------*/
void TIM1CH1_PWM_set(uint16_t val)
{
	TIM_SetCompare1(TIM1, val);
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup PWM on Timer 2 channel 2: pin mapping to PA0
 * Param:	freq	|	IN	|	setup frequency
 * Note:
 * - Partial remap 1:
 *   + TIM2CH1: PA0 -> PA15
 *   + TIM2CH2: PA1 -> PB3
 *   + TIM2CH3: PA2
 *   + TIM2CH4: PA3
 -----------------------------------------------------------------------------------------*/
void TIM2CH1_PWM_setup(TIM_FREQ_t freq)
{
	TIM_OCInitTypeDef TIM_OCInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	TIM_setup(2, freq, (void*)0);
	/* PWM1 Mode configuration: Channel1 */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //TIM_OCPolarity_Low;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High; //TIM_OCNPolarity_Low;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;

	TIM_OC1Init(TIM2, &TIM_OCInitStructure);
	TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Enable);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	TIM_CtrlPWMOutputs(TIM2, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------------------------*/
void TIM2CH1_PWM_set(uint16_t val)
{
	TIM_SetCompare1(TIM2, val);
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup PWM on Timer 2 channel 2: pin mapping to PB3 (Setup partial remap 1)
 * Param:	freq	|	IN	|	setup frequency
 * Note:
 * - Partial remap 1:
 *   + TIM2CH1: PA0 -> PA15
 *   + TIM2CH2: PA1 -> PB3
 *   + TIM2CH3: PA2
 *   + TIM2CH4: PA3
 -----------------------------------------------------------------------------------------*/
void TIM2CH2_PWM_setup(TIM_FREQ_t freq)
{
	TIM_OCInitTypeDef TIM_OCInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	TIM_setup(2, freq, (void*)0);
	/* PWM1 Mode configuration: Channel1 */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //TIM_OCPolarity_Low;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High; //TIM_OCNPolarity_Low;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;

