NguyenDuyThan/Libraries_common/HW_lib/STM32F1_tim.c
	TIM_OC2Init(TIM2, &TIM_OCInitStructure);
	TIM_OC2PreloadConfig(TIM2, TIM_OCPreload_Enable);

	GPIO_PinRemapConfig(GPIO_PartialRemap1_TIM2, ENABLE);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	TIM_CtrlPWMOutputs(TIM2, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------------------------*/
void TIM2CH2_PWM_set(uint16_t val)
{
	TIM_SetCompare2(TIM2, val);
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup input capture feature on Timer 2 channel 4: pin mapping PA3
 -----------------------------------------------------------------------------------------*/
void TIM2CH4_IC_setup(void)
{
	TIM_ICInitTypeDef TIM_ICInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_GetClocksFreq(&RCC_Clocks);
	/* Enable clock source */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
	GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	/* Register to NVIC */
	NVIC_add(TIM2_IRQn);
	/* Configure TIM input capture */
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_4;
	TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	TIM_ICInitStructure.TIM_ICFilter = 0x0;
	TIM_ICInit(TIM2, &TIM_ICInitStructure);
	/* TIM enable counter */
	TIM_Cmd(TIM2, ENABLE);
	/* Enable the CC2 Interrupt Request */
	TIM_ITConfig(TIM2, TIM_IT_CC4, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------------------------*/
uint32_t TIM2CH4_IC_get(void)
{
	uint32_t ret = TIM2CH4_IC_freq;
	TIM2CH4_IC_freq = 0;
	return ret;
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup input capture feature on Timer 3 channel 1: pin mapping PA6
 -----------------------------------------------------------------------------------------*/
void TIM3CH1_IC_setup(void)
{
	TIM_ICInitTypeDef TIM_ICInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_GetClocksFreq(&RCC_Clocks);
	/* Enable clock source */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
	/* TIM3 channel 2 pin (PA.07) configuration */
	GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	/* Register to NVIC */
	NVIC_add(TIM3_IRQn);
	/* Configure TIM input capture */
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_1;
	TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	TIM_ICInitStructure.TIM_ICFilter = 0x0;
	TIM_ICInit(TIM3, &TIM_ICInitStructure);
	/* TIM enable counter */
	TIM_Cmd(TIM3, ENABLE);
	/* Enable the CC2 Interrupt Request */
	TIM_ITConfig(TIM3, TIM_IT_CC1, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------------------------*/
uint32_t TIM3CH1_IC_get(void)
{
	uint32_t ret = TIM3CH1_IC_freq;
	TIM3CH1_IC_freq = 0;
	return TIM3CH1_IC_freq;
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup input capture feature on Timer 3 channel 2: pin mapping PA7
 -----------------------------------------------------------------------------------------*/
void TIM3CH2_IC_setup(void)
{
	TIM_ICInitTypeDef TIM_ICInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

	RCC_GetClocksFreq(&RCC_Clocks);
	/* Enable clock source */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

	TIM_TimeBaseStructure.TIM_Period = 0xFFFF;
	TIM_TimeBaseStructure.TIM_Prescaler = (RCC_Clocks.SYSCLK_Frequency / 1000000) - 1;
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
	/* TIM3 channel 2 pin (PA.07) configuration */
	GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	/* Configure TIM input capture */
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
	TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	TIM_ICInitStructure.TIM_ICFilter = 0;
	TIM_ICInit(TIM3, &TIM_ICInitStructure);
	/* Register to NVIC */
	NVIC_add(TIM3_IRQn);
	/* Enable the CC2 Interrupt Request */
	TIM_ITConfig(TIM3, TIM_IT_CC2, ENABLE);
	/* TIM enable counter */
	TIM_Cmd(TIM3, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief: Read input capture on Timer 3 channel 2: pin mapping PA7
 -----------------------------------------------------------------------------------------*/
uint32_t TIM3CH2_IC_get(void)
{
	uint32_t ret = TIM3CH2_IC_freq;
	TIM3CH2_IC_freq = 0;
	return ret;
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup PWM on Timer 3 channel 1: pin mapping to PA6
 * Param:	freq	|	IN	|	setup frequency
 * Note:
 * - Partial remap:
 *   + TIM3CH1: PA6 -> PB4
 *   + TIM3CH2: PA7 -> PB5
 *   + TIM3CH3: PB0
 *   + TIM3CH4: PB1
 -----------------------------------------------------------------------------------------*/
void TIM3CH1_PWM_setup(TIM_FREQ_t freq)
{
	TIM_OCInitTypeDef TIM_OCInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	TIM_setup(3, freq, (void*)0);
	/* PWM1 Mode configuration: Channel1 */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //TIM_OCPolarity_Low;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High; //TIM_OCNPolarity_Low;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;

