NguyenDuyThan/Libraries_common/HW_lib/STM32F1_tim.c
	TIM_OC1Init(TIM3, &TIM_OCInitStructure);
	TIM_OC1PreloadConfig(TIM3, TIM_OCPreload_Enable);

	GPIO_PinRemapConfig(GPIO_PartialRemap_TIM3, ENABLE);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	TIM_CtrlPWMOutputs(TIM3, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------------------------*/
void TIM3CH1_PWM_set(uint16_t val)
{
	TIM_SetCompare1(TIM3, val);
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup PWM on Timer 3 channel 2: pin mapping to PB5 (Setup partial remap)
 * Param:	freq	|	IN	|	setup frequency
 * Note:
 * - Partial remap:
 *   + TIM3CH1: PA6 -> PB4
 *   + TIM3CH2: PA7 -> PB5
 *   + TIM3CH3: PB0
 *   + TIM3CH4: PB1
 -----------------------------------------------------------------------------------------*/
void TIM3CH2_PWM_setup(TIM_FREQ_t freq)
{
	TIM_OCInitTypeDef TIM_OCInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	TIM_setup(3, freq, (void*)0);
	/* PWM1 Mode configuration: Channel1 */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //TIM_OCPolarity_Low;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High; //TIM_OCNPolarity_Low;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;

	TIM_OC2Init(TIM3, &TIM_OCInitStructure);
	TIM_OC2PreloadConfig(TIM3, TIM_OCPreload_Enable);

	GPIO_PinRemapConfig(GPIO_PartialRemap_TIM3, ENABLE);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	TIM_CtrlPWMOutputs(TIM3, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------------------------*/
void TIM3CH2_PWM_set(uint16_t val)
{
	TIM_SetCompare2(TIM3, val);
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup PWM on Timer 4 channel 1: pin mapping to PB6
 * Param:	freq	|	IN	|	setup frequency
 -----------------------------------------------------------------------------------------*/
void TIM4CH1_PWM_setup(TIM_FREQ_t freq)
{
	TIM_OCInitTypeDef TIM_OCInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	TIM_setup(4, freq, (void*)0);
	/* PWM1 Mode configuration: Channel1 */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //TIM_OCPolarity_Low;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High; //TIM_OCNPolarity_Low;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;

	TIM_OC1Init(TIM4, &TIM_OCInitStructure);
	TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	TIM_CtrlPWMOutputs(TIM4, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------------------------*/
void TIM4CH1_PWM_set(uint16_t val)
{
	TIM_SetCompare1(TIM4, val);
}
/*----------------------------------------------------------------------------------------
 * Brief: Setup PWM on Timer 4 channel 3: pin mapping to PB9
 * Param:	freq	|	IN	|	setup frequency
 -----------------------------------------------------------------------------------------*/
void TIM4CH3_PWM_setup(TIM_FREQ_t freq)
{
	TIM_OCInitTypeDef TIM_OCInitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	TIM_setup(4, freq, (void*)0);
	/* PWM1 Mode configuration: Channel1 */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //TIM_OCPolarity_Low;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High; //TIM_OCNPolarity_Low;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;

	TIM_OC3Init(TIM4, &TIM_OCInitStructure);
	TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	TIM_CtrlPWMOutputs(TIM4, ENABLE);
}
/*----------------------------------------------------------------------------------------
 * Brief:
 -----------------------------------------------------------------------------------------*/
void TIM4CH3_PWM_set(uint16_t val)
{
	TIM_SetCompare3(TIM4, val);
}
/*----------------------------------------------------------------------------------------
 * Brief:	Timer 4 interrupt handler.
 -----------------------------------------------------------------------------------------*/
void TIM1_IRQHandler(void)
{
	RTOS_enterIRQ();
	if(TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		TIM_ClearITPendingBit(TIM1, TIM_IT_Update);
		if (TIM1_tick != (void*)0)
		{
			TIM1_tick();
		}
	}
	RTOS_exitIRQ();
}
/*----------------------------------------------------------------------------------------
 * Brief:	Timer 2 interrupt handler.
 -----------------------------------------------------------------------------------------*/
void TIM2_IRQHandler(void)
{
	RTOS_enterIRQ();
	if (TIM_GetITStatus(TIM2, TIM_IT_CC4) == SET)
	{
		TIM_ClearITPendingBit(TIM2, TIM_IT_CC4);
		if(TIM2CH4_IC_rdVal2 == 0)
		{
			/* Get the Input Capture value */
			TIM2CH4_IC_rdVal1 = TIM_GetCapture4(TIM2);
			TIM2CH4_IC_rdVal2 = 1;
		}
		else if(TIM2CH4_IC_rdVal2 == 1)
		{
			/* Get the Input Capture value */
			TIM2CH4_IC_rdVal2 = TIM_GetCapture4(TIM2);
			/* Capture computation */
			if (TIM2CH4_IC_rdVal2 > TIM2CH4_IC_rdVal1)
			{
				TIM2CH4_IC_freq = (uint32_t) RCC_Clocks.SYSCLK_Frequency / (TIM2CH4_IC_rdVal2 - TIM2CH4_IC_rdVal1);
				//Capture = TIM3CH2_IC_rdVal2 - TIM3CH2_IC_rdVal1;
			}
			else
			{
				//TIM2CH4_IC_freq = (uint32_t) RCC_Clocks.SYSCLK_Frequency / ((0xFFFF - TIM2CH4_IC_rdVal1) + TIM2CH4_IC_rdVal2);
			}
			TIM2CH4_IC_rdVal2 = 0;
		}
	}
	else if(TIM_GetITStatus(TIM2, TIM_IT_Update) == SET)
	{
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
		if (TIM2_tick != (void*)0)
		{
			TIM2_tick();
		}
	}
	RTOS_exitIRQ();
}
/*----------------------------------------------------------------------------------------
 * Brief:	Timer 3 interrupt handler.
 -----------------------------------------------------------------------------------------*/
void TIM3_IRQHandler(void)
{
	RTOS_enterIRQ();
	if(TIM_GetITStatus(TIM3, TIM_IT_CC1) == SET)
	{
		 TIM_ClearITPendingBit(TIM3, TIM_IT_CC2);
	    if(TIM3CH1_IC_rdStep == 0)
	    {
			/* Get the Input Capture value */
	    	TIM3CH1_IC_rdVal1 = TIM_GetCapture1(TIM3);
			TIM3CH1_IC_rdStep = 1;
	    }
	    else if(TIM3CH1_IC_rdStep == 1)
	    {
	    	uint32_t tmp = 0;
			/* Get the Input Capture value */
	    	TIM3CH1_IC_rdVal2 = TIM_GetCapture1(TIM3);
			/* Capture computation */
			if (TIM3CH1_IC_rdVal2 > TIM3CH1_IC_rdVal1)
			{
				tmp = TIM3CH1_IC_rdVal2 - TIM3CH1_IC_rdVal1;
			}
			else
			{
				tmp = 0xFFFF - TIM3CH1_IC_rdVal1;
				tmp += TIM3CH1_IC_rdVal2;
			}
			TIM3CH1_IC_freq = RCC_Clocks.SYSCLK_Frequency / tmp;
			TIM3CH1_IC_rdStep = 0;
	    }
	}
	else if(TIM_GetITStatus(TIM3, TIM_IT_CC2) == SET)
	{
		TIM_ClearITPendingBit(TIM3, TIM_IT_CC2);
//		if(TIM3CH2_IC_rdStep == 0)
//		{
//			/* Get the Input Capture value */
//			TIM3CH2_IC_rdVal1 = TIM_GetCapture2(TIM3);
//			TIM3CH2_IC_rdStep = 1;
//		}
//		else if(TIM3CH2_IC_rdStep == 1)
//		{
//			/* Get the Input Capture value */
//			TIM3CH2_IC_rdVal2 = TIM_GetCapture2(TIM3);
//			/* Capture computation */
//			if (TIM3CH2_IC_rdVal2 > TIM3CH2_IC_rdVal1)
//			{
//				TIM3CH2_IC_freq += (uint32_t)(TIM3CH2_IC_rdVal2 - TIM3CH2_IC_rdVal1);
//			}
//			else
//			{
//				TIM3CH2_IC_freq += ((uint32_t)(0xFFFF - TIM3CH2_IC_rdVal1) + TIM3CH2_IC_rdVal2);
//			}
//			TIM3CH2_IC_rdStep = 0;
//		}
		TIM3_CH2_IC_endTime = TIM_GetCapture2(TIM3);
		TIM3CH2_IC_freq = abs((TIM3CH2_IC_OFct << 16) - TIM3_CH2_IC_startTime + TIM3_CH2_IC_endTime);
		TIM3_CH2_IC_startTime = TIM3_CH2_IC_endTime;
		TIM3CH2_IC_OFct = 0;
	}
	else if (TIM_GetITStatus(TIM3, TIM_IT_Update) == SET)
	{
		TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
		TIM3CH2_IC_OFct++;
		if (TIM3_tick != (void*)0)
		{
			TIM3_tick();
		}
	}
	RTOS_exitIRQ();
}
/*----------------------------------------------------------------------------------------
 * Brief:	Timer 4 interrupt handler.
 -----------------------------------------------------------------------------------------*/
void TIM4_IRQHandler(void)
{
	RTOS_enterIRQ();
	TIM_ClearITPendingBit(TIM4, TIM_IT_Update);
	if (TIM4_tick != (void*)0)
	{
		TIM4_tick();
	}
	RTOS_exitIRQ();
}
/*----------------------------------------------------------------------------------------
 * Brief:	Timer 4 interrupt handler.
 -----------------------------------------------------------------------------------------*/
void TIM5_IRQHandler(void)
{
	RTOS_enterIRQ();
	TIM_ClearITPendingBit(TIM5, TIM_IT_Update);
	if (TIM5_tick != (void*)0)
	{
		TIM5_tick();
	}
	RTOS_exitIRQ();
}
